In [25]:
import pandas as p
names = ['Pooja', 'Alexa', 'Derek','Mary']
grades = [92, 99, 100, 94]
city = ['Chicago', 'New York', 'Gaithersburg','Albany']
age = [45,20,30,47]
gender = ['Male' ,'Female','Male','Female']
gradelist = list(zip(names, grades,age, gender, city))
df = p.DataFrame(data = gradelist, columns=['Names', 'Grades','Age','Gender','Origin'])

In [26]:
print (df)

   Names  Grades  Age  Gender        Origin
0  Pooja      92   45    Male       Chicago
1  Alexa      99   20  Female      New York
2  Derek     100   30    Male  Gaithersburg
3   Mary      94   47  Female        Albany

In [27]:
print (df.head(1))

   Names  Grades  Age Gender   Origin
0  Pooja      92   45   Male  Chicago

In [29]:
df['Gender']

0      Male
1    Female
2      Male
3    Female
Name: Gender, dtype: object

In [43]:
df[3:]

  Names  Grades  Age  Gender  Origin
3  Mary      94   47  Female  Albany

In [41]:
print(df.tail(1))

  Names  Grades  Age  Gender  Origin
3  Mary      94   47  Female  Albany

In [45]:
df['Age'].dtypes

dtype('int64')

In [46]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [47]:
df2=p.read_excel('Desktop/Titanic.xls')
df2.head(2)

   CLASS  AGE  SEX  SURVIVE  Unnamed: 4       CLASS.1
0      1    1    1        1         NaN        0=crew
1      1    1    1        1         NaN       1=first

In [50]:
df3=p.read_csv('Desktop/Titanic.csv')
df3.tail(5)

                        PassengerId\tSurvived\tPclass\tName\tSex\tAge\tSibSp\tParch\tTicket\tFare\tCabin\tEmbarked
152\t1\t1\tPears          Mrs. Thomas (Edith Wearne)\tfemale\t22\t1\t0\...
153\t0\t3\tMeo            Mr. Alfonzo\tmale\t55.5\t0\t0\tA.5. 11206\t8....
154\t0\t3\tvan Billiard   Mr. Austin Blyler\tmale\t40.5\t0\t2\tA/5. 851...
155\t0\t3\tOlsen          Mr. Ole Martin\tmale\t\t0\t0\tFa 265302\t7.31...
156\t0\t1\tWilliams       Mr. Charles Duane\tmale\t51\t0\t1\tPC 17597\t...